---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearDimensionReferenceNotOrthogonalToView
source: html/cc1b0ca9-5215-1d73-85df-93e4dbc0e1da.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearDimensionReferenceNotOrthogonalToView Property

The planes of one or more references are not exactly orthogonal to this view. The dimension to these reference cannot be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId LinearDimensionReferenceNotOrthogonalToView { get; }
```